In [3]:
# Import Panda Library
import pandas as pd
import os

In [4]:
# How to read a csv file
student_data = os.path.join('Resources', 'new_full_student_data.csv')
student_df = pd.read_csv(student_data)
# Shows us the first five lines of a DataFrame
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [5]:
student_df["student_name"]

0           Travis Martin
1           Michael Brown
2         Gabriela Lucero
3        Susan Richardson
4            Sherry Davis
               ...
19509       Robert Sawyer
19510        David Herman
19511          Megan Gill
19512          Lori Stone
19513         Anna Jensen
Name: student_name, Length: 19514, dtype: object